BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega16U2.PIC
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="UCSR1B" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB81" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB81" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ12" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN1" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE1" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE1" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE1" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="nnnnnnnn" edc:cname="UCSR1C" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL1" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ1" edc:desc="Character Size" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USBS1" edc:desc="Stop Bit Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPM1" edc:desc="Parity Mode Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="UMSEL1" edc:desc="USART Mode Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCB" edc:access="------nn" edc:cname="UCSR1D" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTSEN" edc:desc="RTS Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTSEN" edc:desc="CTS Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCC" edc:access="----nnnnnnnnnnnn" edc:cname="UBRR1" edc:nzwidth="0x10" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UBRR1" edc:desc="USART Baud Rate bits" edc:nzwidth="0xC"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCE" edc:access="nnnnnnnn" edc:cname="UDR1" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UDR1" edc:desc="USART I/O Data bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xCF" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="nnnnnn-n" edc:cname="CLKSEL0" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXSUT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RCSUT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="CLKSEL1" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXCKSEL" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RCCKSEL" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="------nn" edc:cname="CLKSTA" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXTON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="n-n-----" edc:cname="USBCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="FRZCLK" edc:desc="Freeze USB Clock Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="USBE" edc:desc="USB macro Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD9" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="-----nnn" edc:cname="UDCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DETACH" edc:desc="Detach Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMWKUP" edc:desc="Remote Wake-up Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTCPU" edc:desc="USB Reset CPU Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnn-n" edc:cname="UDINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPI" edc:desc="Suspend Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFI" edc:desc="Start Of Frame Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTI" edc:desc="End Of Reset Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPI" edc:desc="Wake-up CPU Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSMI" edc:desc="End Of Resume Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSMI" edc:desc="Upstream Resume Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnn-n" edc:cname="UDIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPE" edc:desc="Suspend Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFE" edc:desc="Start Of Frame Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTE" edc:desc="End Of Reset Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPE" edc:desc="Wake-up CPU Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSME" edc:desc="End Of Resume Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSME" edc:desc="Upstream Resume Interrupt Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="UDADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UADD" edc:desc="USB Address Bits" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Address Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
