BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega16U2.PIC
        <edc:SFRDef edc:_addr="0xE4" edc:access="-----nnnnnnnnnnn" edc:cname="UDFNUM" edc:nzwidth="0x10" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number Upper Flag" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE6" edc:access="---n----" edc:cname="UDMFN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="FNCERR" edc:desc="Frame Number CRC Error Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="UEINTX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitter Ready Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLEDI Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAK OUT Received Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWAL" edc:desc="Read/Write Allowed Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAK IN Received Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE9" edc:access="-----nnn" edc:cname="UENUM" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPNUM" edc:desc="Endpoint Number bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEA" edc:access="---nnnnn" edc:cname="UERST" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPRST" edc:desc="Endpoint FIFO Reset Bits" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="--nnn--n" edc:cname="UECONX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPEN" edc:desc="Endpoint Enable Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear Handshake Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request Handshake Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nn-----n" edc:cname="UECFG0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPDIR" edc:desc="Endpoint Direction Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="EPTYPE" edc:desc="Endpoint Type Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="-nnnnnn-" edc:cname="UECFG1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ALLOC" edc:desc="Endpoint Allocation Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPBK" edc:desc="Endpoint Bank Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="EPSIZE" edc:desc="Endpoint Size Bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnn-nnnn" edc:cname="UESTA0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NBUSYBK" edc:desc="Busy Bank Flag" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTSEQ" edc:desc="Data Toggle Sequencing Flag" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="UNDERFI" edc:desc="Underflow Error Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVERFI" edc:desc="Overflow Error Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFGOK" edc:desc="Configuration Status Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="-----nnn" edc:cname="UESTA1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CURRBK" edc:desc="Current Bank" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CTRLDIR" edc:desc="Control Direction" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nn-nnnnn" edc:cname="UEIENX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitter Ready Interrupt Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="Stalled Interrupt Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAK OUT Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAK IN Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLERRE" edc:desc="Flow Error Interrupt Enable Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="UEDATX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAT" edc:desc="Data bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
